mgo-tec/ESP32_WiFi_AP_SSL_Selector/src/ESP32_WiFi_AP_SSL_Selector.cpp
/*
  ESP32_WiFi_AP_SSL_Selector.cpp
  Beta version 1.0

This library is used by the Arduino core for the ESP32 ( use SPIFFS ).

The MIT License (MIT)

Copyright (c) 2018 Mgo-tec

My Blog Site --> https://www.mgo-tec.com

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

WiFi.h - Included WiFi library for esp32
Based on WiFi.h from Arduino WiFi shield library.
Copyright (c) 2011-2014 Arduino.  All right reserved.
Modified by Ivan Grokhotkov, December 2014
Licensed under the LGPL-2.1

FS.h - file system wrapper
Copyright (c) 2015 Ivan Grokhotkov. All rights reserved.
Licensed under the LGPL-2.1

Reference LGPL-2.1 license statement --> https://opensource.org/licenses/LGPL-2.1   

SPIFFS.h - Included SPIFFS library for esp32
Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
Licensed under the Apache License, Version 2.0 (the "License");

ssl.h - Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
Licensed under the Apache License, Version 2.0

Reference Apache License --> http://www.apache.org/licenses/LICENSE-2.0

sockets.h - Copyright (c) 2001-2004 Swedish Institute of Computer Science. All rights reserved.
This file is part of the lwIP TCP/IP stack.
Author: Adam Dunkels <adam@sics.se>

openssl_server_example_main.c ( ESP-IDF ) - Modification.
Licensed under The Public Domain

Modify SPIFFS_test of sample sketch ( Arduino core for the ESP32 ).
*/

#include "ESP32_WiFi_AP_SSL_Selector.h"

ESP32_WiFi_AP_SSL_Selector::ESP32_WiFi_AP_SSL_Selector(){}

//******************************************
void ESP32_WiFi_AP_SSL_Selector::Init(uint16_t HTTPS_port, uint16_t ssl_recv_buf_len, char spiffs_ssid_c[], char spiffs_pass_c[]){
  _STA_StaticIP_OK = false;
  _https_port = HTTPS_port;
  _ssl_recv_buf_len = ssl_recv_buf_len;
  _Selected_SSID_str = String(spiffs_ssid_c);
  _Sel_PASS_str = String(spiffs_pass_c);

  _primaryDNS = {8,8,8,8}; //optional
  _secondaryDNS = {8,8,4,4}; //optional

  __server1.begin();
  Serial.println(F("-----------HTTP server(80) begin-----------"));
  delay(100);
}
//******************************************
void ESP32_WiFi_AP_SSL_Selector::Init_StaticIP(uint16_t HTTPS_port, uint16_t ssl_recv_buf_len, IPAddress Local_IP, IPAddress Gateway, IPAddress Subnet, IPAddress PriDNS, IPAddress SecDNS, char spiffs_ssid_c[], char spiffs_pass_c[]){
  _STA_StaticIP_OK = true;
  _https_port = HTTPS_port;
  _ssl_recv_buf_len = ssl_recv_buf_len;
  _local_ip = Local_IP;
  _gateway = Gateway;
  _subnet = Subnet;
  _primaryDNS = PriDNS;
  _secondaryDNS = SecDNS;
  _Selected_SSID_str = String(spiffs_ssid_c);
  _Sel_PASS_str = String(spiffs_pass_c);

  __server1.begin();
  Serial.println(F("-----------HTTP server(80) begin-----------"));
  delay(100);
}
//******************************************
void ESP32_WiFi_AP_SSL_Selector::softAP_http_server(){
  if(_ssl_redirect == true) return;

  String html_meta = "<meta http-equiv='refresh' content='0; URL=\"https://192.168.4.1\"' />\r\n";
  String html_msg = "ESP32 softAP mode<br>SSL Server Connecting...";

  __client1 = __server1.available();

  if (__client1) {
    Serial.println(F("HTTP New Client."));
    String currentLine = "";
    uint32_t LastTime = millis();
    while (__client1.connected()) {
      if( (millis()-LastTime) > 30000 ){ //timeout setting
        Serial.println("-------------softAP__client1 timeout");
        break;
      }
      if (__client1.available()) {
        currentLine = __client1.readStringUntil('\n');
        if(currentLine.indexOf("\r") == 0) break;
        Serial.println(currentLine);
        if(currentLine.indexOf("GET / HTTP/1.1") >= 0){
          currentLine = __client1.readStringUntil('\n');
          if(currentLine.indexOf("Host: 192.168.4.1") >= 0){
            Serial.println(F("------------ HTTP request received ---------------"));    
            __client1.println( ESP32_WiFi_AP_SSL_Selector::HTML_Res_Head() );
            __client1.println( ESP32_WiFi_AP_SSL_Selector::HTML_Http_Body(html_meta, html_msg) );
            __client1.println();
            currentLine = "";
            _ssl_redirect = true;
            break;
          }else{
            break;
          }
        }else if(currentLine.indexOf("GET /favicon") >= 0){
          __client1.print("HTTP/1.1 404 Not Found\r\n");
          __client1.println("Connection:close\r\n\r\n");
          break;
        }
      }
    }
    char c = 0x00;
    while(__client1.available()){
      c = __client1.read();
      Serial.print(c);
    }
    delay(10);
    __client1.stop();
    delay(10);
  }
}
//******************************************
void ESP32_WiFi_AP_SSL_Selector::openssl_init(const char* cert_path, const char* prvt_key_path){
  int ret;
  uint16_t len = 0;
  char cert_or_prvt_temp[4096] = {};

  log_e("SSL server context create ......");
    Serial.println(F("SSL server context create ......"));

    _ctx = SSL_CTX_new(TLS_server_method());

    if (!_ctx) {
        log_e("failed1");
        goto failed1;
    }
    log_e("OK-1");

    log_e("SSL server context set own certification......");

    len = ESP32_WiFi_AP_SSL_Selector::SPIFFS_read_PKI_File(cert_path, cert_or_prvt_temp);
    Serial.printf("cert_length = %d\r\n", len);
    log_v("cert\r\n%s", (const char*)cert_or_prvt_temp);

