mgo-tec/ESP32_WiFi_AP_SSL_Selector/src/ESP32_WiFi_AP_SSL_Selector.cpp
    ret = SSL_CTX_use_certificate_ASN1(_ctx, len, (const unsigned char*)cert_or_prvt_temp);
    if (!ret) {
        log_e("failed");
        goto failed2;
    }
    log_e("OK-2");

    log_e("SSL server context set private key......");

    len = ESP32_WiFi_AP_SSL_Selector::SPIFFS_read_PKI_File(prvt_key_path, cert_or_prvt_temp);
    Serial.printf("prvt_length = %d\r\n", len);
    log_v("prvt key\r\n%s", (const char*)cert_or_prvt_temp);

    ret = SSL_CTX_use_PrivateKey_ASN1(0, _ctx, (const unsigned char*)cert_or_prvt_temp, len);
    if (!ret) {
        log_e("failed");
        goto failed2;
    }
    log_e("OK-3");

    log_e("SSL server create socket ......");

    _sockfd = socket(AF_INET, SOCK_STREAM, 0);
    if (_sockfd < 0) {
        log_e("failed");
        goto failed2;
    }
    log_e("OK-4");

    log_e("SSL server socket bind ......");

    memset(&_sock_addr, 0, sizeof(_sock_addr));
    _sock_addr.sin_family = AF_INET;
    _sock_addr.sin_addr.s_addr = 0;
    _sock_addr.sin_port = htons(_https_port);

    ret = bind(_sockfd, (struct sockaddr*)&_sock_addr, sizeof(_sock_addr));
    Serial.print(F("------------------- bind ret = ")); Serial.println(ret);
    if (ret > 0) {
        log_e("failed");
        goto failed3;
    }
    log_e("OK-5");

    log_e("SSL server socket listen ......");

    ret = listen(_sockfd, 32);
    if (ret) {
        log_e("failed");
        goto failed3;
    }
    log_e("OK-6");
    return;

failed3:
    log_e("----------------goto failed3:");
    close(_sockfd);
    lwip_close_r(_sockfd);
    _sockfd = -1;
failed2:
    log_e("----------------goto failed2:");
    SSL_CTX_free(_ctx);
    _ctx = NULL;
failed1:
    log_e("----------------goto failed1:");
    //vTaskDelete(NULL);
    return ;
}
//************************************************
int8_t ESP32_WiFi_AP_SSL_Selector::SSL_softAP_WiFi_Selector(const char* APconfigFile_path, char* ssid1, char* pass1){
    if(_ssl_redirect == false) return -1;

    int ret;
    char recv_buf[_ssl_recv_buf_len];
    String html_tag1, html_tag2;
    int16_t getTXT_pass ,getTXT_select, getTXT_disconnect;
    String req_str;
    String str_w;
    String NowTime;
    boolean softAP_server_end_OK = false;
    //※型宣言はgoto文の前に無ければならない。gotoをまたいで宣言不可なので注意

reconnect:
    Serial.println(F("----------------SSL reconnect in"));

    log_e("SSL server create ......");
    _ssl = SSL_new(_ctx);
    if (!_ssl) {
        log_e("failed");
        goto failed3;
    }
    log_e("OK-7");

    log_e("SSL server socket accept client ......");

    _new_sockfd = accept(_sockfd, (struct sockaddr *)&_sock_addr, &_addr_len);
    if (_new_sockfd < 0) {
        log_e("failed" );
        goto failed4;
    }
    log_e("OK-8");

    SSL_set_fd(_ssl, _new_sockfd);

    log_e("SSL server accept client ......");

    ret = SSL_accept(_ssl);
    if (!ret) {
        log_e("failed");
        goto failed5;
    }
    log_e("OK-9");
    log_e("SSL server read message ......");

    do {
        memset(recv_buf, 0, _ssl_recv_buf_len); //recv_buf を0x00で初期化
        ret = SSL_read(_ssl, recv_buf, _ssl_recv_buf_len - 1);
        if (ret <= 0) {
            break;
        }
        log_e("SSL read: %s", recv_buf);
        if (strstr(recv_buf, "GET / HTTP/1.1")) {
            Serial.println(F("------------GET request receive[GET / HTTP/1.1]"));
            log_e("SSL get matched message");
            log_e("SSL write message");

            if(WiFi.status() == WL_CONNECTED){
              ESP32_WiFi_AP_SSL_Selector::html_send(WiFi.SSID(), "ESP32 STA connect OK!", "#0F0");
              Serial.println(F("------------ESP32 STA connect OK!-------------"));
            }else{
              ESP32_WiFi_AP_SSL_Selector::html_send("---", "ESP32 STA Cannot Connect<br>", "#F00");
            }
 
            break;
        }else if (strstr(recv_buf, "GET /?")) {
          log_e("SSL get matched message");
          log_e("SSL write message");

          req_str = String(recv_buf);

          Serial.println(F("--------------- SUBMIT Receive from Clinet"));
          getTXT_pass = req_str.indexOf("&pass1=");
          getTXT_select = req_str.indexOf("GET /?ssid_select=");
          getTXT_disconnect = req_str.indexOf("GET /?disconnect=");

          if(req_str.indexOf("GET /?reconnect=")>=0){
            Serial.println(F("------------GET request receive[GET /?reconnect]"));
            ESP32_WiFi_AP_SSL_Selector::WiFi_STA_Connect(ssid1, pass1, 20000);

            if(WiFi.status() == WL_CONNECTED){
              ESP32_WiFi_AP_SSL_Selector::html_send(WiFi.SSID(), "ESP32 STA Reconnect OK!", "#0F0");
              Serial.println(F("------------ESP32 STA Reconnect OK!-------------"));
            }else{
              ESP32_WiFi_AP_SSL_Selector::html_send("---", "ESP32 STA Cannot connect<br>", "#F00");
              Serial.println(F("------------ESP32 STA Cannot connect"));
            }

            req_str = "";
            _ssl_redirect = true;
            break;
          }

          if(req_str.indexOf("GET /?re_scan=")>=0){
            Serial.println(F("------------GET request receive[GET /?re_scan]"));
            _First_Scan_Set = true;
            ESP32_WiFi_AP_SSL_Selector::wifi_scan(20000);
            ESP32_WiFi_AP_SSL_Selector::html_send("---", "Wi-Fi ReScan OK!", "#AAF");

            Serial.println(F("-----------------WiFi ReScan OK!"));
            _wifi_rescan = false;
            _ssl_redirect = true;

            break;
          }

          if(req_str.indexOf("GET /?exit=")>=0){
            Serial.println(F("------------GET request receive[GET /?exit]"));
            String html_res_head = ESP32_WiFi_AP_SSL_Selector::HTML_Res_Head();
            String msg_str = "ESP32 softAP mode<br>SSL Server EXIT";
            String html_res_body = ESP32_WiFi_AP_SSL_Selector::HTML_Http_Body("", msg_str);

            SSL_write(_ssl, html_res_head.c_str(), html_res_head.length());
            SSL_write(_ssl, html_res_body.c_str(), html_res_body.length());
            _wifi_rescan = true;
            _ssl_redirect = false;
            softAP_server_end_OK = true;
            Serial.println(F("------------softAP server end()--------------"));
            break;
          }

          if(getTXT_pass > 0){
            _Sel_PASS_str = req_str.substring(getTXT_pass + 7, req_str.indexOf("&ssid_sel_submit")) + "\0";
          }
          if(getTXT_select >= 0){
            _Selected_SSID_str = req_str.substring(getTXT_select + 18, getTXT_pass) + "\0";
          }
          if(getTXT_disconnect < 0){
            Serial.println(F("----------------- GET SSID & Password"));
            Serial.printf("Selected_SSID_str = %s\r\n", _Selected_SSID_str.c_str());
            Serial.printf("Sel_SSID_PASS_str = %s\r\n", _Sel_PASS_str.c_str());

