mgo-tec/ESP32_WiFi_AP_SSL_Selector/src/ESP32_WiFi_AP_SSL_Selector.cpp
            str_w = _Selected_SSID_str + "\r\n" + _Sel_PASS_str + "\r\n\0";

            ESP32_WiFi_AP_SSL_Selector::SPIFFS_writeFile(APconfigFile_path, str_w);
            delay(100);

            ESP32_WiFi_AP_SSL_Selector::SPIFFS_readFile(APconfigFile_path, ssid1, pass1);
            Serial.print(F("SPIFFS read ssid = ")); Serial.println(ssid1);
            Serial.print(F("SPIFFS read pass = ")); Serial.println(pass1);

            if(WiFi.status() == WL_CONNECTED){
              if(String(pass1) != WiFi.psk()){
                ESP32_WiFi_AP_SSL_Selector::html_send(WiFi.SSID(), "Incorrect Password", "#F00");
                _ssl_redirect = true;
                req_str = "";
                break;
              }
            }
            Serial.printf("\r\n%s Connecting ...\r\n", _Selected_SSID_str.c_str());

            delay(10); // Important! This delay is necessary to connect to the Access Point.
 
            ESP32_WiFi_AP_SSL_Selector::WiFi_STA_Connect(ssid1, pass1, 20000);
            if(WiFi.status() != WL_CONNECTED){
              ESP32_WiFi_AP_SSL_Selector::html_send("---", "ESP32 STA cannot connect", "#F00");
              _ssl_redirect = true;
              break;
            }

            ESP32_WiFi_AP_SSL_Selector::html_send(WiFi.SSID(), "ESP32 STA connect OK!", "#0F0");
            Serial.println(F("------------ESP32 STA connect OK!-------------"));

            _ssl_redirect = true;
            req_str = "";
            break;
          }else{
            ESP32_WiFi_AP_SSL_Selector::html_send("---", "ESP32 STA Disconnect!", "#F00");
            WiFi.disconnect(false); //false=WiFi_ON , true=WiFi_OFF
            Serial.println(F("================ Wi-Fi STA mode Disconnect ================"));
            delay(300);
            req_str = "";
            _ssl_redirect = true;
            break;
          }

          req_str = "";
          break;
        }else if(strstr(recv_buf, "GET /favicon")){
          ESP32_WiFi_AP_SSL_Selector::favicon_response();
          req_str = "";
          break;
        }
    } while (1);

    Serial.println(F("----------------SSL_shutdown"));
    SSL_shutdown(_ssl);
failed5:
    log_e("----------------goto failed5:");
    close(_new_sockfd);
    _new_sockfd = -1;
failed4:
    log_e("----------------goto failed4:");
    SSL_free(_ssl);
    _ssl = NULL;
    delay(200); //これ重要。これが無いとうまくWebページが表示されない。

    if(softAP_server_end_OK == true) return 2;
    if(_wifi_rescan == true) return 1;

    if(_ssl_redirect == true){
      goto reconnect;
    }else{
      return 1;
    }

failed3:
    log_e("----------------goto failed3:");
    close(_sockfd);
    lwip_close_r(_sockfd);
    _sockfd = -1;

    return 1;
}
//*******************************************
int8_t ESP32_WiFi_AP_SSL_Selector::WiFi_STA_Connect(char* ssid1, char* pass1, uint32_t timeout){
  Serial.println(F("Connecting ..."));

  if(_STA_StaticIP_OK == true){
    Serial.println(F("Static IP set up ..."));
    if (!WiFi.config(_local_ip, _gateway, _subnet, _primaryDNS, _secondaryDNS)) {
      Serial.println(F("STA Failed to configure"));
    }
  }

  WiFi.begin(ssid1, pass1);
  uint32_t LastTime = millis();

  while(WiFi.status() != WL_CONNECTED){
    delay(500);
    Serial.print(".");
    if(millis()-LastTime > timeout){
      Serial.println(F("---------STA cannot connected time out------------"));
      return -1;
    }
  }

  _local_ip = WiFi.localIP();
  _gateway = WiFi.gatewayIP();
  _subnet = WiFi.subnetMask();

  _STA_StaticIP_OK = true;

  Serial.println(F("\r\nWiFi connected"));
  Serial.print(F("Local IP address: ")); Serial.println(_local_ip);
  //Serial.print(F("WiFi STA status: ")); Serial.println(WiFi.status());
  Serial.print(F("SSID = ")); Serial.println(WiFi.SSID());
  //Serial.print(F("PSK = ")); Serial.println(WiFi.psk()); //display password
  //Serial.print(F("ESP Mac Address: "));
  //Serial.println(WiFi.macAddress());
  Serial.print(F("Subnet Mask: "));
  Serial.println(_subnet);
  Serial.print(F("Gateway IP: "));
  Serial.println(_gateway);
  delay(500);
  return 1;
}
//*******************************************
String ESP32_WiFi_AP_SSL_Selector::HTML_Res_Head(){
  String html_res_head = "HTTP/1.1 200 OK\r\n";
         html_res_head += "Content-type:text/html\r\n";
         html_res_head += "Connection:close\r\n\r\n";
  return html_res_head;
}
//******************************************
String ESP32_WiFi_AP_SSL_Selector::HTML_Http_Body(String meta_str, String message_str){
  String str = "<!DOCTYPE html>\r\n";
         str += "<html>\r\n<head>\r\n";
         str += meta_str + "\r\n";
         str += "<meta name='viewport' content='initial-scale=1.3'>\r\n";
         str += "</head>\r\n";
         str += "<body style='font-size:100%;'>\r\n";
         str += message_str + "<br>\r\n";
         str += "\r\n</body>\r\n</html>\r\n";
  return str;
}
//*******************************************
String ESP32_WiFi_AP_SSL_Selector::HTML_Submit_Button(String name1, String font_color, String back_color, String message, String button_name){
  String str = "<form name='F_";
         str += name1;
         str += "'>\r\n";
         str += "  <button type='submit' name='";
         str += name1;
         str += "' value='send' style='color:";
         str += font_color;
         str += "; background-color:";
         str += back_color;
         str += "; border-radius:10px;' onclick='document.getElementById(\"ssid_sel_txt\").innerHTML=\"";
         str += message;
         str += "\";'>";
         str += button_name;
         str += "</button>\r\n";
         str += "</form>\r\n";
  return str;
}
//*******************************************
void ESP32_WiFi_AP_SSL_Selector::html_send(String now_ssid_str, String message2, String msg2_color){
  String str = "";
  String selected_str = "";

  str = ESP32_WiFi_AP_SSL_Selector::HTML_Res_Head();
  SSL_write(_ssl, str.c_str(), str.length());

  str = "<!DOCTYPE html>\r\n<html>\r\n";
  str += "<head>\r\n";
  str += "<meta name='viewport' content='initial-scale=1.3'>\r\n";
  str += "</head>\r\n";
  str += "<body style='background:#000; color:#fff; font-size:1em;'>\r\n";
  str += "ESP32 (ESP-WROOM-32)<br>\r\n";
  str += "Access Point Selector beta 1.0<br>\r\n";
  SSL_write(_ssl, str.c_str(), str.length());

  str = "<form name='F_ssid_select'>\r\n";
  str += "  <select name='ssid_select'>\r\n";
  for(int i=0; i<_ssid_num; i++){
    if(_Selected_SSID_str == _ssid_str[i]){
      selected_str = " selected";
    }else{
      selected_str = "";
    }
    str += "    <option value='" + _ssid_str[i] + "'" + selected_str + ">" + _ssid_rssi_str[i] + "</option>\r\n";
  }
  str += "</select><br>\r\n";
  str += "Password<br><input type='password' name='pass1'>\r\n";
  str += "<br><button type='submit' name='ssid_sel_submit' value='send' style='background-color:#AFA; border-radius:10px;' onclick='document.getElementById(\"ssid_sel_txt\").innerHTML=document.F_ssid_select.ssid_select.value;'>STA Connection GO!</button>\r\n";
  str += "</form><hr>\r\n";

