mgo-tec/ESP32_WiFi_AP_SSL_Selector/src/ESP32_WiFi_AP_SSL_Selector.cpp
  SSL_write(_ssl, str.c_str(), str.length());

  str = ESP32_WiFi_AP_SSL_Selector::HTML_Submit_Button("re_scan", "#000", "#DDD", "Wi-Fi ReScaning...", "Wi-Fi ReScan");
  str += "<hr>\r\n";
  str += "<div style='display:inline-flex'>\r\n";
  str += ESP32_WiFi_AP_SSL_Selector::HTML_Submit_Button("disconnect", "#000", "#F99", "ESP32 STA Disconnecting...", "STA Disconnect");
  str += "&nbsp;\r\n";
  str += ESP32_WiFi_AP_SSL_Selector::HTML_Submit_Button("reconnect", "#000", "#AAF", "ESP32 STA Reconnecting...", "STA Reconnect");
  str += "</div><hr>\r\n";
  str += ESP32_WiFi_AP_SSL_Selector::HTML_Submit_Button("exit", "#000", "#DDD", "softAP EXITing...", "softAP EXIT");
  str += "<hr>\r\n";
  str += "(Selected SSID)<br><span id='ssid_sel_txt'  style='font-size:80%;'>";
  str += now_ssid_str;
  str += "</span>\r\n";

  SSL_write(_ssl, str.c_str(), str.length());

  str = "<p style='color:" + msg2_color + "; font-size:80%'>" + message2 + "</p>\r\n";

  if(WiFi.status() == WL_CONNECTED){
    str += "<span style='font-size:80%'>ESP32 STA IP = ";
    IPAddress LIP = WiFi.localIP();
    str += LIP.toString(); //※これ、重要。IPアドレス整数をドット表記String型に変更する関数。
    str += "</span>\r\n";
  }

  str += "\r\n</body>\r\n</html>\r\n\r\n";

  SSL_write(_ssl, str.c_str(), str.length());
}
//*******************************************
void ESP32_WiFi_AP_SSL_Selector::favicon_response(){
  Serial.println(F("-----------------------Favicon GET Request Received"));

  String str1 = "HTTP/1.1 404 Not Found\r\n";
  String str2 = "Connection:close\r\n\r\n";
  SSL_write(_ssl, str1.c_str(), str1.length());
  SSL_write(_ssl, str2.c_str(), str2.length());
}
//*******************************************
void ESP32_WiFi_AP_SSL_Selector::wifi_scan(uint32_t scan_interval){
  if( (_First_Scan_Set == true) || ((millis() - _scanLastTime) > scan_interval) ){
    Serial.println(F("scan start"));

    // WiFi.scanNetworks will return the number of networks found
    _ssid_num = WiFi.scanNetworks();
    Serial.println(F("scan done\r\n"));
    if (_ssid_num == 0) {
      Serial.println(F("no networks found\r\n"));
    } else {
      Serial.printf("%d networks found\r\n\r\n", _ssid_num);
      for (int i = 0; i < _ssid_num; ++i) {
        _ssid_str[i] = WiFi.SSID(i);
        String wifi_auth_open = ((WiFi.encryptionType(i) == WIFI_AUTH_OPEN)?" ":"*");
        _ssid_rssi_str[i] = _ssid_str[i] + " (" + WiFi.RSSI(i) + "dBm)" + wifi_auth_open;
        Serial.printf("%d: %s\r\n", i, _ssid_rssi_str[i].c_str());
        delay(10);
      }
    }
    Serial.println();
    _scanLastTime = millis();
    _First_Scan_Set = false;
  }
}
//******************************************
uint16_t ESP32_WiFi_AP_SSL_Selector::SPIFFS_read_PKI_File(const char * path, char pki_cstr[]){
  Serial.print(F("SPIFFS file reading --- ")); Serial.println(path);
  File file = SPIFFS.open(path, FILE_READ);
  if(!file){
    Serial.println(F("Failed to open file for writing"));
    return 0;
  }
  uint16_t i = 0;

  while(file.available()){
    pki_cstr[i] = file.read();
    if(pki_cstr[i] == '\0') break;
    i++;
  }
  pki_cstr[i] = '\0';

  delay(10);
  file.close();
  delay(10);
  return i;
}
//*******************************************
void ESP32_WiFi_AP_SSL_Selector::SPIFFS_writeFile(const char * path, String c_ssid_pass){
  Serial.printf("SPIFFS writing file: %s\n", path);

  deleteFile(path);
  delay(10);
  File file = SPIFFS.open(path, FILE_WRITE);
  if(!file){
    Serial.println(F("Failed to open file for writing"));
    return;
  }
  if(file.print(c_ssid_pass)){
    Serial.println(c_ssid_pass);
    Serial.println(F("SPIFFS file written\r\n"));
  } else {
    Serial.println(F("SPIFFS write failed\r\n"));
  }
  delay(10);
  file.close();
  delay(10);
}
//*******************************************
void ESP32_WiFi_AP_SSL_Selector::deleteFile(const char * path){
  Serial.printf("Deleting file: %s\r\n", path);
  if(SPIFFS.remove(path)){
    Serial.println(F("- file deleted"));
  } else {
    Serial.println(F("- delete failed"));
  }
  delay(10);
}
//*******************************************
void ESP32_WiFi_AP_SSL_Selector::SPIFFS_readFile(const char * path, char ssid_c[], char pass_c[]){
  Serial.printf("SPIFFS reading file: %s\n", path);

  File file = SPIFFS.open(path);
  if(!file || file.isDirectory()){
    Serial.println(F("SPIFFS Failed to open file for reading"));
    return;
  }

  int i=0, j=0;
  while(file.available()){
    ssid_c[i] = file.read();
    if(ssid_c[i] == '\0') break;
    if(ssid_c[i] == '\r'){
      ssid_c[i] = '\0';
      char c = file.read();
      if(c == '\n'){
        break;
      }
    }
    i++;
    if( i>63 ) break;
  }
  while(file.available()){
    pass_c[j] = file.read();
    if(pass_c[j] == '\0') break;
    if(pass_c[j] == '\r'){
      pass_c[j] = '\0';
      char c = file.read();
      if(c == '\n'){
        break;
      }
    }
    j++;
    if( j>63 ) break;
  }
  if(i < 1) Serial.println(F("Nothing ssid"));
  if(j < 1) Serial.println(F("Nothing password"));
  delay(10);
  file.close();
  delay(10);
}